20240805_waterFlashing/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	2.0;     
	format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0];

internalField   uniform 2e4;

boundaryField
{
    inlet
    {
        type            totalPressure;
		rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 10000000;
        value           uniform 10000000;
    }

    outlet
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        20000;
        lInf            0.03;
        value           uniform 20000;
    }

    walls
    {
        type            zeroGradient;
    }

    frontBack
    {
        type            empty;
    }
}

// ************************************************************************* //
