20240805_waterFlashing/Allrun
# this code is used for the no-phase change solution


# twoPhaseMixingCentralFoamHLLC3 | tee log.txt


twoPhaseMixingCentralFoamHLLC3 | tee log.txt
#------------------------------------------------------------------------------
