20240805_waterFlashing/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          132;
        startFace       1010520;
    }
    outlet
    {
        type            patch;
        nFaces          1116;
        startFace       1010652;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1152;
        startFace       1011768;
    }
    frontBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1011168;
        startFace       1012920;
    }
)

// ************************************************************************* //
