20240805_waterFlashing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseMixingCentralFoamHLLC3;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

deltaT          1e-12;

writeControl    adjustableRunTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.5;
maxAlphaCo      1;

CourantType     cellCourant;

#include "control.local"
libs ("libcompressibleTools.so");
//functions
//{
//    #include "conservativityControlDict"
//}


// ************************************************************************* //
