20240805_waterFlashing/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;  
	format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
		sourceInfo
        {
            
			box (0.0048 -0.0002 -1) (0.0053 0.0002 1);
		}
        
    }
    {
        name    c0;
        type    cellSet;
        action  add;
        source  boxToCell;
		sourceInfo
        {
            
			box (0.0053 -0.0015 -1) (0.008 0.0015 1);
		}
        
    }
);

// ************************************************************************* //
